node {
  name: "GeOp1_0_dp"
  op: "GeOp"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "Tin"
    value {
      list {
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
      }
    }
  }
  attr {
    key: "_NpuOptimizer"
    value {
      s: "NpuOptimizer"
    }
  }
  attr {
    key: "_auto_tune_mode"
    value {
      s: ""
    }
  }
  attr {
    key: "_buffer_optimize"
    value {
      s: "l2_optimize"
    }
  }
  attr {
    key: "_compress_weight_conf"
    value {
      s: ""
    }
  }
  attr {
    key: "_debug_dir"
    value {
      s: ""
    }
  }
  attr {
    key: "_distribute_config"
    value {
      s: ""
    }
  }
  attr {
    key: "_do_npu_optimizer"
    value {
      s: "1"
    }
  }
  attr {
    key: "_dump_debug_mode"
    value {
      s: "all"
    }
  }
  attr {
    key: "_dump_mode"
    value {
      s: "output"
    }
  }
  attr {
    key: "_dump_path"
    value {
      s: "./"
    }
  }
  attr {
    key: "_dump_step"
    value {
      s: "1"
    }
  }
  attr {
    key: "_dynamic_dims"
    value {
      s: ""
    }
  }
  attr {
    key: "_dynamic_graph_execute_mode"
    value {
      s: "dynamic_execute"
    }
  }
  attr {
    key: "_dynamic_input"
    value {
      s: "0"
    }
  }
  attr {
    key: "_dynamic_node_type"
    value {
      s: ""
    }
  }
  attr {
    key: "_enable_compress_weight"
    value {
      s: "0"
    }
  }
  attr {
    key: "_enable_data_pre_proc"
    value {
      s: "0"
    }
  }
  attr {
    key: "_enable_dump"
    value {
      s: "1"
    }
  }
  attr {
    key: "_enable_dump_debug"
    value {
      s: "1"
    }
  }
  attr {
    key: "_enable_exception_dump"
    value {
      s: ""
    }
  }
  attr {
    key: "_enable_scope_fusion_passes"
    value {
      s: ""
    }
  }
  attr {
    key: "_enable_small_channel"
    value {
      s: "0"
    }
  }
  attr {
    key: "_fusion_switch_file"
    value {
      s: ""
    }
  }
  attr {
    key: "_graph_run_mode"
    value {
      s: "1"
    }
  }
  attr {
    key: "_hcom_multi_mode"
    value {
      s: ""
    }
  }
  attr {
    key: "_hcom_parallel"
    value {
      s: "0"
    }
  }
  attr {
    key: "_in_out_pair"
    value {
      s: ""
    }
  }
  attr {
    key: "_in_out_pair_flag"
    value {
      s: "1"
    }
  }
  attr {
    key: "_input_shape"
    value {
      s: ""
    }
  }
  attr {
    key: "_is_tailing_optimization"
    value {
      s: "0"
    }
  }
  attr {
    key: "_iterations_per_loop"
    value {
      s: "1"
    }
  }
  attr {
    key: "_job"
    value {
      s: "localhost"
    }
  }
  attr {
    key: "_local_device_list"
    value {
      s: ""
    }
  }
  attr {
    key: "_local_rank_id"
    value {
      s: "-1"
    }
  }
  attr {
    key: "_lower_functional_ops"
    value {
      s: "0"
    }
  }
  attr {
    key: "_mix_compile_mode"
    value {
      s: "0"
    }
  }
  attr {
    key: "_mstune_mode"
    value {
      s: ""
    }
  }
  attr {
    key: "_op_compiler_cache_dir"
    value {
      s: ""
    }
  }
  attr {
    key: "_op_compiler_cache_mode"
    value {
      s: ""
    }
  }
  attr {
    key: "_op_debug_level"
    value {
      s: "0"
    }
  }
  attr {
    key: "_op_select_implmode"
    value {
      s: ""
    }
  }
  attr {
    key: "_op_tune_mode"
    value {
      s: ""
    }
  }
  attr {
    key: "_optypelist_for_implmode"
    value {
      s: ""
    }
  }
  attr {
    key: "_precision_mode"
    value {
      s: ""
    }
  }
  attr {
    key: "_profiling_mode"
    value {
      s: "0"
    }
  }
  attr {
    key: "_profiling_options"
    value {
      s: ""
    }
  }
  attr {
    key: "_session_device_id"
    value {
      s: ""
    }
  }
  attr {
    key: "_stream_max_parallel_num"
    value {
      s: ""
    }
  }
  attr {
    key: "_task_index"
    value {
      s: "0"
    }
  }
  attr {
    key: "_use_off_line"
    value {
      s: "1"
    }
  }
  attr {
    key: "_variable_format_optimize"
    value {
      s: "1"
    }
  }
  attr {
    key: "_work_path"
    value {
      s: ""
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "function"
    value {
      func {
        name: "geop_function_D9x45pM0kZ0"
      }
    }
  }
}
library {
  function {
    signature {
      name: "geop_function_D9x45pM0kZ0"
    }
    node_def {
      name: "dpop_function_FFvj93e0XnN"
      op: "DPOP"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Tin"
        value {
          list {
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
          }
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      attr {
        key: "func_def"
        value {
          s: "\n\271\001\n;\n\037__inference_Dataset_map_func_11\022\n\n\006args_0\030\002\032\014\n\010identity\030\002\0326\n\005add/y\022\005Const*\031\n\005value\022\020B\016\010\002\022\0002\010\000\000\000\000\000\000\360?*\013\n\005dtype\022\0020\002\032-\n\003add\022\005AddV2\032\016add/y:output:0\032\006args_0*\007\n\001T\022\0020\002\"\023\n\010identity\022\007add:z:0\n\356\016\n\033\n\031dpop_function_FFvj93e0XnN\032p\n\nbatch_size\022\005Const\",/job:localhost/replica:0/task:0/device:CPU:0*\022\n\005value\022\tB\007\010\t\022\000R\001\002*\013\n\005dtype\022\0020\t2\014\n\nbatch_size\032x\n\016drop_remainder\022\005Const\",/job:localhost/replica:0/task:0/device:CPU:0*\022\n\005value\022\tB\007\010\n\022\000Z\001\000*\013\n\005dtype\022\0020\n2\020\n\016drop_remainder\032\365\002\n\nIteratorV2\022\nIteratorV2\",/job:localhost/replica:0/task:0/device:CPU:0*\033\n\024_iterations_per_loop\022\003\022\0011*\024\n\r_use_off_line\022\003\022\0011*\030\n\021_mix_compile_mode\022\003\022\0010*\021\n\013shared_name\022\002\022\000*\"\n\routput_shapes\022\021\n\017:\r\022\013\010\377\377\377\377\377\377\377\377\377\001*\037\n\006_class\022\025\n\023\022\021loc:@MakeIterator*\037\n\r_NpuOptimizer\022\016\022\014NpuOptimizer*\017\n\tcontainer\022\002\022\000*\025\n\014output_types\022\005\n\0032\001\002*\023\n\004_job\022\013\022\tlocalhost*\034\n\025_enable_data_pre_proc\022\003\022\00112\014\n\nIteratorV2\032\357\002\n\016BatchDatasetV2\022\016BatchDatasetV2\032^DeviceQueue_Queue_Edge_from_TensorSliceDataset_out0_To_BatchDatasetV2_in0_FcR1b09W8p1:handle:0\032\023batch_size:output:0\032\027drop_remainder:output:0\",/job:localhost/replica:0/task:0/device:CPU:0*\017\n\007_kernel\022\004\022\002dp*\036\n\016_iterator_name\022\014\022\nIteratorV2*\025\n\014output_types\022\005\n\0032\001\002*\023\n\rparallel_copy\022\002(\000*\"\n\routput_shapes\022\021\n\017:\r\022\013\010\377\377\377\377\377\377\377\377\377\0012\020\n\016BatchDatasetV2\032\240\002\n\nMapDataset\022\nMapDataset\032\027BatchDatasetV2:handle:0\",/job:localhost/replica:0/task:0/device:CPU:0*\"\n\routput_shapes\022\021\n\017:\r\022\013\010\377\377\377\377\377\377\377\377\377\001*(\n\001f\022#R!\n\037__inference_Dataset_map_func_11*\036\n\030use_inter_op_parallelism\022\002(\001*\025\n\014output_types\022\005\n\0032\001\002*\020\n\nTarguments\022\002\n\000*\032\n\024preserve_cardinality\022\002(\0002\014\n\nMapDataset\032\265\001\n\014MakeIterator\022\014MakeIterator\032\023MapDataset:handle:0\032\023IteratorV2:handle:0\",/job:localhost/replica:0/task:0/device:CPU:0*\017\n\007_kernel\022\004\022\002dp*\036\n\016_iterator_name\022\014\022\nIteratorV22\016\n\014MakeIterator\032\235\003\nUDeviceQueue_Queue_Edge_from_TensorSliceDataset_out0_To_BatchDatasetV2_in0_FcR1b09W8p1\022\022DeviceQueueDataset\",/job:localhost/replica:0/task:0/device:CPU:0*\025\n\routput_shapes\022\004\n\002:\000*[\n\014channel_name\022K\022IQueue_Edge_from_TensorSliceDataset_out0_To_BatchDatasetV2_in0_FcR1b09W8p1*\036\n\016_iterator_name\022\014\022\nIteratorV2*\025\n\014output_types\022\005\n\0032\001\0022W\nUDeviceQueue_Queue_Edge_from_TensorSliceDataset_out0_To_BatchDatasetV2_in0_FcR1b09W8p1"
        }
      }
      attr {
        key: "function"
        value {
          func {
            name: "dpop_function_FFvj93e0XnN"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "dpop_function_FFvj93e0XnN"
    }
    node_def {
      name: "batch_size"
      op: "Const"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
            }
            int64_val: 2
          }
        }
      }
      experimental_debug_info {
        original_node_names: "batch_size"
      }
    }
    node_def {
      name: "drop_remainder"
      op: "Const"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "dtype"
        value {
          type: DT_BOOL
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_BOOL
            tensor_shape {
            }
            bool_val: false
          }
        }
      }
      experimental_debug_info {
        original_node_names: "drop_remainder"
      }
    }
    node_def {
      name: "IteratorV2"
      op: "IteratorV2"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_NpuOptimizer"
        value {
          s: "NpuOptimizer"
        }
      }
      attr {
        key: "_class"
        value {
          list {
            s: "loc:@MakeIterator"
          }
        }
      }
      attr {
        key: "_enable_data_pre_proc"
        value {
          s: "1"
        }
      }
      attr {
        key: "_iterations_per_loop"
        value {
          s: "1"
        }
      }
      attr {
        key: "_job"
        value {
          s: "localhost"
        }
      }
      attr {
        key: "_mix_compile_mode"
        value {
          s: "0"
        }
      }
      attr {
        key: "_use_off_line"
        value {
          s: "1"
        }
      }
      attr {
        key: "container"
        value {
          s: ""
        }
      }
      attr {
        key: "output_shapes"
        value {
          list {
            shape {
              dim {
                size: -1
              }
            }
          }
        }
      }
      attr {
        key: "output_types"
        value {
          list {
            type: DT_DOUBLE
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: ""
        }
      }
      experimental_debug_info {
        original_node_names: "IteratorV2"
      }
    }
    node_def {
      name: "BatchDatasetV2"
      op: "BatchDatasetV2"
      input: "DeviceQueue_Queue_Edge_from_TensorSliceDataset_out0_To_BatchDatasetV2_in0_FcR1b09W8p1:handle:0"
      input: "batch_size:output:0"
      input: "drop_remainder:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_iterator_name"
        value {
          s: "IteratorV2"
        }
      }
      attr {
        key: "_kernel"
        value {
          s: "dp"
        }
      }
      attr {
        key: "output_shapes"
        value {
          list {
            shape {
              dim {
                size: -1
              }
            }
          }
        }
      }
      attr {
        key: "output_types"
        value {
          list {
            type: DT_DOUBLE
          }
        }
      }
      attr {
        key: "parallel_copy"
        value {
          b: false
        }
      }
      experimental_debug_info {
        original_node_names: "BatchDatasetV2"
      }
    }
    node_def {
      name: "MapDataset"
      op: "MapDataset"
      input: "BatchDatasetV2:handle:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Targuments"
        value {
          list {
          }
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_Dataset_map_func_11"
          }
        }
      }
      attr {
        key: "output_shapes"
        value {
          list {
            shape {
              dim {
                size: -1
              }
            }
          }
        }
      }
      attr {
        key: "output_types"
        value {
          list {
            type: DT_DOUBLE
          }
        }
      }
      attr {
        key: "preserve_cardinality"
        value {
          b: false
        }
      }
      attr {
        key: "use_inter_op_parallelism"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MapDataset"
      }
    }
    node_def {
      name: "MakeIterator"
      op: "MakeIterator"
      input: "MapDataset:handle:0"
      input: "IteratorV2:handle:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_iterator_name"
        value {
          s: "IteratorV2"
        }
      }
      attr {
        key: "_kernel"
        value {
          s: "dp"
        }
      }
      experimental_debug_info {
        original_node_names: "MakeIterator"
      }
    }
    node_def {
      name: "DeviceQueue_Queue_Edge_from_TensorSliceDataset_out0_To_BatchDatasetV2_in0_FcR1b09W8p1"
      op: "DeviceQueueDataset"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_iterator_name"
        value {
          s: "IteratorV2"
        }
      }
      attr {
        key: "channel_name"
        value {
          s: "Queue_Edge_from_TensorSliceDataset_out0_To_BatchDatasetV2_in0_FcR1b09W8p1"
        }
      }
      attr {
        key: "output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "output_types"
        value {
          list {
            type: DT_DOUBLE
          }
        }
      }
      experimental_debug_info {
        original_node_names: "DeviceQueue_Queue_Edge_from_TensorSliceDataset_out0_To_BatchDatasetV2_in0_FcR1b09W8p1"
      }
    }
  }
}
versions {
  producer: 134
}
